---
kind: method
id: M:Autodesk.Revit.DB.DocumentSet.Erase(Autodesk.Revit.DB.Document)
source: html/95cc8762-e291-7f35-00f6-8ceedcd95849.htm
---
# Autodesk.Revit.DB.DocumentSet.Erase Method

Removes a specified object from the set.

## Syntax (C#)
```csharp
public virtual int Erase(
	Document item
)
```

## Parameters
- **item** (`Autodesk.Revit.DB.Document`) - The item to be erased.

## Returns
The number of items that were erased from the set.